Revit 2024 API
CurtainGrid Members
The CurtainGrid type exposes the following members.
Methods
Name | Description
AddGridLine
 Add a grid line to the curtain grid.
ChangePanelType
 Change the type of a curtain panel.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCell
 Get the specified cell located by the intersection of the grid lines.
GetCurtainCells
 Gets the CurtainCells owned by this curtain grid.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMullionIds
 Gets all ElementIds of the mullions of the curtain grid.
GetPanel
 Get the specified panel located by the intersection of the grid lines.
GetPanelIds
 Gets all ElementIds of the panels of the curtain grid.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetUGridLineIds
 Gets all ElementIds of grid lines in the U direction.
GetUnlockedMullionIds
 Gets all ElementIds of the unlocked mullions of the curtain grid.
GetUnlockedPanelIds
 Gets all ElementIds of the unlocked panels of the curtain grid.
GetVGridLineIds
 Gets all ElementIds of grid lines in the V direction.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Grid1Angle
The angle for the U grid line pattern of the curtain grid.
Grid1Justification
The justification for the U grid line pattern of the curtain grid.
Grid1Offset
The offset for the U grid line pattern of the curtain grid.
Grid2Angle
The angle for V grid line pattern of the curtain grid.
Grid2Justification
The justification for the V grid line pattern of the curtain grid.
Grid2Offset
The offset for V grid line pattern of the curtain grid.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
NumPanels
 The number of panels.
NumULines
 Get the number of grid lines in the U direction.
NumVLines
 Get the number of grid lines in the V direction.
See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace